Revit 2024 API
ParameterTypeId.RbsElecCircuitNumberingType Property
 "Circuit Numbering Option"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RbsElecCircuitNumberingType { get; }
Visual Basic
Public Shared ReadOnly Property RbsElecCircuitNumberingType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RbsElecCircuitNumberingType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace